{"conditions": {"menstrualPhase": {"menstrual": {"label": {"en": "Menstrual Phase", "zh": "月经期"}, "recommendations": {"recommendedFoods": [ {"en": "Iron-rich foods: lean red meat, poultry, spinach, lentils, beans", "zh": "富含铁的食物：瘦红肉、禽肉、菠菜、扁豆、豆类"}, {"en": "Vitamin C-rich foods to enhance iron absorption: citrus fruits, bell peppers, broccoli", "zh": "富含维生素C的食物以促进铁吸收：柑橘类水果、甜椒、西兰花"}, {"en": "Omega-3 fatty acids for anti-inflammatory effects: salmon, walnuts, flaxseeds", "zh": "富含Omega-3脂肪酸以抗炎：三文鱼、核桃、亚麻籽"}, {"en": "Magnesium-rich foods to ease cramps: dark leafy greens, nuts, seeds", "zh": "富含镁的食物以缓解痉挛：深色绿叶蔬菜、坚果、种子"}, {"en": "Warm, easy-to-digest foods: ginger tea, soups, congee", "zh": "温热、易消化的食物：姜茶、汤、粥"} ], "foodsToAvoid": [ {"en": "Cold and raw foods, which may worsen cramps", "zh": "生冷食物，可能加重痉挛"}, {"en": "Spicy and greasy foods that can cause digestive upset", "zh": "辛辣油腻食物，可能引起消化不适"}, {"en": "Excessive salt, sugar, caffeine, and alcohol", "zh": "过量的盐、糖、咖啡因和酒精"} ], "lifestyleTips": [ {"en": "Stay hydrated by drinking plenty of warm water.", "zh": "喝足量的温水以保持水分。"}, {"en": "Keep your body, especially the abdominal area, warm.", "zh": "保持身体温暖，特别是腹部。"}, {"en": "Engage in light activities like walking or gentle stretching.", "zh": "进行散步或轻柔伸展等轻度活动。"} ]}}, "follicular": {"label": {"en": "Follicular Phase", "zh": "卵泡期"}, "recommendations": {"recommendedFoods": [ {"en": "Lean proteins to support egg development: chicken, fish, tofu, beans", "zh": "支持卵泡发育的瘦蛋白：鸡肉、鱼肉、豆腐、豆类"}, {"en": "Cruciferous vegetables to help metabolize estrogen: broccoli, cauliflower, kale", "zh": "帮助雌激素代谢的十字花科蔬菜：西兰花、菜花、羽衣甘蓝"}, {"en": "Healthy fats for hormone production: avocado, nuts, seeds (flax, pumpkin)", "zh": "支持激素生成的健康脂肪：牛油果、坚果、种子（亚麻籽、南瓜籽）"}, {"en": "Complex carbohydrates for sustained energy: oats, quinoa, brown rice", "zh": "提供持续能量的复合碳水化合物：燕麦、藜麦、糙米"}, {"en": "Fermented foods for gut health: yogurt, kimchi, kombucha", "zh": "有益肠道健康的发酵食品：酸奶、泡菜、康普茶"} ], "foodsToAvoid": [ {"en": "Excessive alcohol, which can disrupt hormonal balance", "zh": "过量饮酒，可能扰乱荷尔蒙平衡"}, {"en": "Highly processed foods and refined sugars", "zh": "高度加工食品和精制糖"} ], "lifestyleTips": [ {"en": "This is a great time for more energetic workouts.", "zh": "这是进行更有活力锻炼的好时机。"}, {"en": "Focus on nutrient-dense foods to build up your body's resources.", "zh": "专注于营养密集的食物，以补充身体资源。"} ]}}, "ovulation": {"label": {"en": "Ovulation Phase", "zh": "排卵期"}, "recommendations": {"recommendedFoods": [ {"en": "High-fiber foods to support estrogen detoxification: vegetables, whole grains, nuts", "zh": "支持雌激素排毒的高纤维食物：蔬菜、全谷物、坚果"}, {"en": "Antioxidant-rich foods to protect the egg: berries, leafy greens, colorful vegetables", "zh": "保护卵子的富含抗氧化剂的食物：浆果、绿叶蔬菜、色彩鲜艳的蔬菜"}, {"en": "Zinc for reproductive health: oysters, pumpkin seeds, lentils", "zh": "有益生殖健康的锌：牡蛎、南瓜籽、扁豆"}, {"en": "B-vitamins for energy and hormone regulation: whole grains, lean meat, eggs", "zh": "支持能量和激素调节的B族维生素：全谷物、瘦肉、鸡蛋"} ], "foodsToAvoid": [ {"en": "Excessive caffeine and alcohol", "zh": "过量的咖啡因和酒精"}, {"en": "Inflammatory foods like fried foods and refined carbohydrates", "zh": "油炸食品和精制碳水化合物等炎性食物"} ], "lifestyleTips": [ {"en": "Ensure adequate hydration to support cervical fluid.", "zh": "确保充足水分以支持宫颈粘液。"}, {"en": "Listen to your body; energy levels are at their peak.", "zh": "倾听身体的声音；此时能量水平处于顶峰。"} ]}}, "luteal": {"label": {"en": "Luteal Phase", "zh": "黄体期"}, "recommendations": {"recommendedFoods": [ {"en": "Magnesium-rich foods to reduce cramps and improve mood: pumpkin seeds, spinach, dark chocolate", "zh": "富含镁以减少痉挛和改善情绪的食物：南瓜籽、菠菜、黑巧克力"}, {"en": "Vitamin B6 to support progesterone production: chickpeas, salmon, bananas", "zh": "支持孕酮生成的维生素B6：鹰嘴豆、三文鱼、香蕉"}, {"en": "Complex carbs to stabilize blood sugar and mood: sweet potatoes, oats, quinoa", "zh": "稳定血糖和情绪的复合碳水化合物：红薯、燕麦、藜麦"}, {"en": "Calcium-rich foods to ease PMS: yogurt, tofu, almonds", "zh": "缓解经前综合症的富含钙的食物：酸奶、豆腐、杏仁"} ], "foodsToAvoid": [ {"en": "Excessive salt to reduce bloating and water retention", "zh": "过量的盐以减少腹胀和水分潴留"}, {"en": "High-sugar snacks that can cause mood swings", "zh": "可能导致情绪波动的高糖零食"}, {"en": "Caffeine and alcohol, which can worsen PMS symptoms", "zh": "咖啡因和酒精，可能加重经前综合症症状"} ], "lifestyleTips": [ {"en": "Engage in calming exercises like yoga or walking.", "zh": "进行瑜伽或散步等舒缓的运动。"}, {"en": "Prioritize sleep to help regulate hormones.", "zh": "优先保证睡眠以帮助调节荷尔蒙。"}, {"en": "Drink plenty of water to combat bloating.", "zh": "喝大量水以对抗腹胀。"} ]}}}, "healthGoals": {"anemiaPrevention": {"label": {"en": "Prevent Iron-Deficiency Anemia", "zh": "预防缺铁性贫血"}, "recommendations": {"recommendedFoods": [ {"en": "Heme iron sources (easily absorbed): lean red meat, poultry, fish, liver", "zh": "血红素铁来源（易吸收）：瘦红肉、禽肉、鱼肉、肝脏"}, {"en": "Non-heme iron sources: lentils, spinach, tofu, beans, fortified cereals", "zh": "非血红素铁来源：扁豆、菠菜、豆腐、豆类、强化谷物"}, {"en": "Pair iron-rich foods with Vitamin C to boost absorption: bell peppers, oranges, strawberries, broccoli", "zh": "将富含铁的食物与维生素C搭配以促进吸收：甜椒、橙子、草莓、西兰花"} ], "foodsToAvoid": [ {"en": "Tea and coffee with meals, as tannins inhibit iron absorption", "zh": "餐中饮用茶和咖啡，因为单宁会抑制铁的吸收"}, {"en": "High-calcium foods (like dairy) taken at the same time as iron-rich meals", "zh": "与富含铁的膳食同时摄入高钙食物（如乳制品）"}, {"en": "Foods high in phytates like whole-grain bran, unless soaked or fermented", "zh": "富含植酸盐的食物，如全麦麸皮（除非经过浸泡或发酵）"} ], "lifestyleTips": [ {"en": "Cook in cast-iron skillets to add a small amount of iron to your food.", "zh": "用铸铁锅烹饪，可以为食物增加少量铁质。"}, {"en": "Combine heme and non-heme iron sources in the same meal for better overall absorption.", "zh": "在同一餐中结合血红素铁和非血红素铁来源，以提高整体吸收率。"} ]}}, "pmsRelief": {"label": {"en": "Alleviate PMS Symptoms", "zh": "缓解经前综合症"}, "recommendations": {"recommendedFoods": [ {"en": "Magnesium for cramps and mood: leafy greens, nuts, seeds, dark chocolate", "zh": "缓解痉挛和改善情绪的镁：绿叶蔬菜、坚果、种子、黑巧克力"}, {"en": "Vitamin B6 for mood and bloating: chickpeas, salmon, bananas, potatoes", "zh": "改善情绪和腹胀的维生素B6：鹰嘴豆、三文鱼、香蕉、土豆"}, {"en": "Calcium to reduce mood swings and fatigue: yogurt, tofu, fortified milk, leafy greens", "zh": "减少情绪波动和疲劳的钙：酸奶、豆腐、强化奶、绿叶蔬菜"}, {"en": "Omega-3 fatty acids for anti-inflammatory benefits: fatty fish (salmon, mackerel), flaxseed, walnuts", "zh": "具有抗炎功效的Omega-3脂肪酸：富含脂肪的鱼类（三文鱼、鲭鱼）、亚麻籽、核桃"}, {"en": "Complex carbohydrates to stabilize blood sugar: whole grains, vegetables, beans", "zh": "稳定血糖的复合碳水化合物：全谷物、蔬菜、豆类"} ], "foodsToAvoid": [ {"en": "Excessive salt, which contributes to bloating and breast tenderness", "zh": "过量的盐，会导致腹胀和乳房胀痛"}, {"en": "Refined sugar, which can lead to energy crashes and mood swings", "zh": "精制糖，可能导致能量骤降和情绪波动"}, {"en": "Caffeine and alcohol, which can increase anxiety and disrupt sleep", "zh": "咖啡因和酒精，可能增加焦虑并扰乱睡眠"} ], "lifestyleTips": [ {"en": "Stay well-hydrated to help alleviate bloating.", "zh": "保持充足水分以帮助缓解腹胀。"}, {"en": "Engage in regular, moderate exercise to boost mood and reduce cramps.", "zh": "进行规律的适度运动以提升情绪和减少痉挛。"}, {"en": "Prioritize getting 7-9 hours of quality sleep per night.", "zh": "优先保证每晚7-9小时的优质睡眠。"} ]}}}, "tcmConstitution": {"qiDeficiency": {"label": {"en": "Qi Deficiency", "zh": "气虚"}, "recommendations": {"recommendedFoods": [ {"en": "Qi-tonifying foods: chicken, beef, yam, sweet potato, oats, rice, dates, shiitake mushrooms", "zh": "补气食物：鸡肉、牛肉、山药、红薯、燕麦、大米、红枣、香菇"}, {"en": "Warm, cooked, and easily digestible foods", "zh": "温热、煮熟且易消化的食物"}, {"en": "Root vegetables like carrots and parsnips", "zh": "胡萝卜、防风草等根茎类蔬菜"} ], "foodsToAvoid": [ {"en": "Raw and cold foods (salads, smoothies, iced drinks)", "zh": "生冷食物（沙拉、冰沙、冰镇饮料）"}, {"en": "Greasy, heavy, and hard-to-digest foods", "zh": "油腻、厚重和难以消化的食物"}, {"en": "Qi-depleting foods like white radish and excessive mint", "zh": "耗气食物，如白萝卜和过量的薄荷"} ], "lifestyleTips": [ {"en": "Eat regular meals in a relaxed environment and chew thoroughly.", "zh": "在放松的环境中规律进餐并充分咀嚼。"}, {"en": "Avoid overexertion and ensure adequate rest.", "zh": "避免过度劳累并确保充足休息。"} ]}}, "yangDeficiency": {"label": {"en": "Yang Deficiency", "zh": "阳虚"}, "recommendations": {"recommendedFoods": [ {"en": "Warming foods and spices: lamb, shrimp, ginger, cinnamon, cloves, leeks, walnuts", "zh": "温性食物和香料：羊肉、虾、姜、肉桂、丁香、韭菜、核桃"}, {"en": "Cooked foods, especially soups and stews", "zh": "熟食，特别是汤和炖菜"}, {"en": "Warming grains like quinoa and oats", "zh": "藜麦和燕麦等温性谷物"} ], "foodsToAvoid": [ {"en": "Cold and raw foods and drinks (ice cream, salads, chilled water)", "zh": "生冷食物和饮料（冰淇淋、沙拉、冰水）"}, {"en": "Cooling foods such as cucumber, watermelon, bitter melon, and crab", "zh": "凉性食物，如黄瓜、西瓜、苦瓜和螃蟹"} ], "lifestyleTips": [ {"en": "Keep the body, especially the lower back and feet, warm.", "zh": "保持身体温暖，特别是腰背和脚部。"}, {"en": "Engage in gentle exercise that warms the body, like brisk walking.", "zh": "进行快走等能使身体变暖的温和运动。"} ]}}, "yinDeficiency": {"label": {"en": "Yin Deficiency", "zh": "阴虚"}, "recommendations": {"recommendedFoods": [ {"en": "Yin-nourishing foods: duck, pork, pear, asparagus, black beans, millet, tofu, mung beans", "zh": "滋阴食物：鸭肉、猪肉、梨、芦笋、黑豆、小米、豆腐、绿豆"}, {"en": "Cooling and hydrating foods: cucumber, watermelon, celery", "zh": "凉润和补水的食物：黄瓜、西瓜、芹菜"}, {"en": "Slightly sweet and sour fruits like apple and lemon", "zh": "苹果、柠檬等微甜微酸的水果"} ], "foodsToAvoid": [ {"en": "Spicy and pungent foods: chili, garlic, onion, ginger", "zh": "辛辣刺激性食物：辣椒、大蒜、洋葱、生姜"}, {"en": "Warming and drying foods: lamb, shrimp, grilled or fried foods, coffee, alcohol", "zh": "温燥食物：羊肉、虾、烧烤或油炸食品、咖啡、酒精"} ], "lifestyleTips": [ {"en": "Go to bed early to nourish Yin energy.", "zh": "早睡以滋养阴气。"}, {"en": "Avoid excessive sweating; opt for calming exercises like yoga or tai chi.", "zh": "避免过度出汗；选择瑜伽或太极等镇静的运动。"} ]}}, "phlegmDampness": {"label": {"en": "Phlegm-Dampness", "zh": "痰湿"}, "recommendations": {"recommendedFoods": [ {"en": "Dampness-resolving foods: Job's tears (coix seed), adzuki beans, radish, winter melon, celery", "zh": "化湿食物：薏苡仁、赤小豆、萝卜、冬瓜、芹菜"}, {"en": "Aromatic spices that transform dampness: ginger, cardamom, orange peel (chenpi)", "zh": "芳香化湿的香料：生姜、豆蔻、陈皮"}, {"en": "Lightly cooked vegetables and lean proteins", "zh": "轻度烹饪的蔬菜和瘦蛋白"} ], "foodsToAvoid": [ {"en": "Greasy, fried, and rich foods", "zh": "油腻、油炸和肥甘厚味的食物"}, {"en": "Dairy products, sugar, and sweets", "zh": "乳制品、糖和甜食"}, {"en": "Excessive raw fruits and cold foods", "zh": "过量的生水果和冷食"} ], "lifestyleTips": [ {"en": "Engage in regular physical activity to move Qi and resolve dampness.", "zh": "进行规律的体育活动以行气化湿。"}, {"en": "Eat smaller, more frequent meals and avoid overeating.", "zh": "少食多餐，避免过饱。"} ]}}, "dampHeat": {"label": {"en": "Damp-Heat", "zh": "湿热"}, "recommendations": {"recommendedFoods": [ {"en": "Foods that clear heat and drain dampness: bitter melon, winter melon, mung beans, Job's tears (coix seed), cucumber, celery", "zh": "清热利湿的食物：苦瓜、冬瓜、绿豆、薏苡仁、黄瓜、芹菜"}, {"en": "Bland and cooling foods like barley and watercress", "zh": "大麦、西洋菜等清淡凉性食物"}, {"en": "Green tea and chrysanthemum tea", "zh": "绿茶和菊花茶"} ], "foodsToAvoid": [ {"en": "Greasy, fried, and spicy foods", "zh": "油腻、油炸和辛辣的食物"}, {"en": "Sweet foods and alcohol", "zh": "甜食和酒类"}, {"en": "Warming foods like lamb, beef, and pungent spices", "zh": "羊肉、牛肉和辛辣香料等温性食物"} ], "lifestyleTips": [ {"en": "Maintain a simple and clean diet.", "zh": "保持简单清淡的饮食。"}, {"en": "Avoid humid environments and stay cool.", "zh": "避免潮湿环境并保持凉爽。"}, {"en": "Ensure emotional balance, as stress can worsen heat symptoms.", "zh": "确保情绪平衡，因为压力会加重热症。"} ]}}}}} 